Autodesk.Revit.DB.BuiltInFailures.TagFailures.TagsCannotBePlacedInUnlocked3dViews
Tags can't be pasted into Unlocked 3D views.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.MultiCategoryTagFilterParamNotFoundInElement
The filter specified by Multi-Category Tag can't be used with the tagged object.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTagUpgrade
During upgrade, Revit discovered that the highlighted elements were marked with tags of the wrong category. These tags were deleted.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.ElementCategoryChangeInvalidatesTag
Elements have changed category. Tags for these elements are now of the wrong category and will be deleted.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.CannotPasteTag
Can't find new element to tag. Tag won't be copied.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.CannotPasteOrphanTagsWarn
Orphaned tags cannot be pasted.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.CannotPasteOrphanTags
Orphaned tags cannot be pasted.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.CannotCopyTagWarn
A tag cannot be arrayed without copying the associated element.

Autodesk.Revit.DB.BuiltInFailures.TagFailures.CannotCopyTag
A tag cannot be arrayed without copying the associated element.

Autodesk.Revit.DB.BuiltInFailures.TagFailures
Failures about Tag.